source/_static/diagrams/23-testing-2.d2
direction: right
n0: "four questions"
n1: "package test suite"
n2: "sanity check"
n3: "test report"
n4: "ReFrame run"
n0 -> n1
n1 -> n2
n2 -> n3
n3 -> n4
